In [39]:
import pandas as pd
import numpy as np
from tqdm import tqdm

- 2018년자료 엑셀 -> csv화

In [15]:
for yy in range(18,19):

    for mm in tqdm(range(1, 12)):
        try:
            yy_str = str(yy).zfill(2)
            mm_str = str(mm).zfill(2)
            temp = pd.read_excel('./Data/서울특별시 공공자전거 이용정보(시간대별)_20{0}년/서울특별시 공공자전거 이용정보(시간대별)_{0}.{1}.xlsx'.format(yy_str, mm_str), header=0)
            temp.to_csv('./Data/서울특별시 공공자전거 이용정보(시간대별)_20{0}년/서울특별시 공공자전거 이용정보(시간대별)_{0}.{1}.csv'.format(yy_str, mm_str))

        except:
            print('err'+yy_str+mm_str)
            pass

100%|██████████████████████████████████████████████████████████████████████████████████| 11/11 [16:42<00:00, 91.16s/it]

- 함수: 각 csv파일 불러와서 한곳에 데이터프레임화
 - df 부분 # 필요한 컬럼으로 변경해서 사용

In [41]:
def creat_data(yy, mm):
    file_path = './Data/서울특별시 공공자전거 이용정보(시간대별)_20{0}년/서울특별시 공공자전거 이용정보(시간대별)_{0}.{1}.csv'.format(yy,mm)
    f = pd.read_csv(file_path)
    
    df = f[['대여일자', '대여시간', '대여소번호', '이용건수']]
    
    return(df)

- 파일 모으기 : DF

In [42]:
DF = pd.DataFrame()

year = ['18', '19', '20', '21']

for yy in year:

    for mm in tqdm(range(1, 13)):
        try:
            mm_str = str(mm).zfill(2)
            temp = creat_data(yy, mm_str)
            DF = DF.append(temp, ignore_index=True)

        except:
            print('err'+yy+mm)
            pass

100%|██████████████████████████████████████████████████████████████████████████████████| 12/12 [00:10<00:00,  1.14it/s]
 17%|█████████████▊                                                                     | 2/12 [00:01<00:05,  1.75it/s]C:\Users\sec\AppData\Local\Temp\ipykernel_14576\1191457939.py:10: DtypeWarning: Columns (10,11) have mixed types.Specify dtype option on import or set low_memory=False.
  temp = creat_data(yy, mm_str)
100%|██████████████████████████████████████████████████████████████████████████████████| 12/12 [00:28<00:00,  2.35s/it]
100%|██████████████████████████████████████████████████████████████████████████████████| 12/12 [00:36<00:00,  3.06s/it]
100%|██████████████████████████████████████████████████████████████████████████████████| 12/12 [00:55<00:00,  4.60s/it]

In [47]:
DF

                대여일자  대여시간  대여소번호  이용건수
0         2018-01-01     0    300   1.0
1         2018-01-01     0    505   1.0
2         2018-01-01     0   1531   1.0
3         2018-01-01     0    516   1.0
4         2018-01-01     0   3508   1.0
...              ...   ...    ...   ...
65186222  2021-12-31    23   4561   1.0
65186223  2021-12-31    23    815   1.0
65186224  2021-12-31    23   2173   1.0
65186225  2021-12-31    23   2718   1.0
65186226  2021-12-31    23   4620   1.0

[65186227 rows x 4 columns]

# 전처리

- 대여일자 -> 월 변환

In [50]:
a = []
b = DF['대여일자']

In [51]:
for i in tqdm(range(0, len(DF))):
    a.append(b[i][:7])

100%|██████████████████████████████████████████████████████████████████| 65186227/65186227 [03:14<00:00, 334985.11it/s]

In [52]:
DF['월'] = np.array(a).reshape(-1,1)
DF

                대여일자  대여시간  대여소번호  이용건수        월
0         2018-01-01     0    300   1.0  2018-01
1         2018-01-01     0    505   1.0  2018-01
2         2018-01-01     0   1531   1.0  2018-01
3         2018-01-01     0    516   1.0  2018-01
4         2018-01-01     0   3508   1.0  2018-01
...              ...   ...    ...   ...      ...
65186222  2021-12-31    23   4561   1.0  2021-12
65186223  2021-12-31    23    815   1.0  2021-12
65186224  2021-12-31    23   2173   1.0  2021-12
65186225  2021-12-31    23   2718   1.0  2021-12
65186226  2021-12-31    23   4620   1.0  2021-12

[65186227 rows x 5 columns]

In [53]:
DF.isnull().sum()

대여일자     0
대여시간     0
대여소번호    0
이용건수     0
월        0
dtype: int64

In [58]:
DF['이용건수'] = DF['이용건수'].astype('int')

In [59]:
DF

                대여일자  대여시간  대여소번호  이용건수        월
0         2018-01-01     0    300     1  2018-01
1         2018-01-01     0    505     1  2018-01
2         2018-01-01     0   1531     1  2018-01
3         2018-01-01     0    516     1  2018-01
4         2018-01-01     0   3508     1  2018-01
...              ...   ...    ...   ...      ...
65186222  2021-12-31    23   4561     1  2021-12
65186223  2021-12-31    23    815     1  2021-12
65186224  2021-12-31    23   2173     1  2021-12
65186225  2021-12-31    23   2718     1  2021-12
65186226  2021-12-31    23   4620     1  2021-12

[65186227 rows x 5 columns]

# 저장

In [60]:
DF.to_csv('./Data/전체따릉이요약.csv')